---
kind: property
id: P:Autodesk.Revit.DB.ReferencePointArray.Size
source: html/1110b433-b0db-c974-faee-2a48a8bf1f74.htm
---
# Autodesk.Revit.DB.ReferencePointArray.Size Property

Returns the number of references that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```